# Лабораторные работы по космической геодезии
# Работа 1. Координатные системы отсчёта и системы времени при решении задач космической геодезии
# Усольцев Артём, ПГ-31, 2023 год
# Вариант 36
########################################################################################################################

from math import sin, cos, sqrt, radians, degrees, atan
import numpy as np
from ellipsoids import wgs84, krasovsky
from dms import dms2rad, rad2dms
np.set_printoptions(suppress=True, precision=10)

# Параметры ориентировки эллипсоида Красовского относительно ПЗ-90
# Координаты мгновенного полюса
x_p = 0.25 / 3600
y_p = -0.315 / 3600
# Вектор переноса начал T (meters)
T_X = 25.0
T_Y = -130.94
T_Z = -81.76
T_XYZ = np.array([[T_X], [T_Y], [T_Z]])
# Вектор малого вращения w
w_X = radians(0.000 / 3600)
w_Y = radians(0.035 / 3600)
w_Z = radians(0.660 / 3600)
w_XYZ = np.array([[w_X], [w_Y], [w_Z]])
########################################################################################################################

# Исходные данные по вариантам
# Геодезические координаты ИСЗ в системе ПЗ-90
B_wgs84 = dms2rad(44, 29, 21.76)
L_wgs84 = dms2rad(21, 34, 7.03)
H_wgs84 = 841_412
BLH_wgs84 = np.array([[B_wgs84], [L_wgs84], [H_wgs84]])
# Сферические топоцентрические координаты ИСЗ в истинной небесной системе
rho = 842_105
alpha = dms2rad(13, 17, 53.14)
delta = dms2rad(43, 53, 50.13)
# Момент наблюдения по гринвичскому звёздному времени
S = 12 + 8 / 60 + 49.30 / 3600  # in hours

########################################################################################################################
##############################################                 #########################################################
##############################################     РЕШЕНИЕ     #########################################################
##############################################                 #########################################################
########################################################################################################################

N_wgs84 = wgs84.N(B_wgs84)

# 1. Геодезические прямоугольные координаты спутника в системе ПЗ-90
X_wgs84 = (N_wgs84 + H_wgs84) * cos(B_wgs84) * cos(L_wgs84)
Y_wgs84 = (N_wgs84 + H_wgs84) * cos(B_wgs84) * sin(L_wgs84)
Z_wgs84 = (N_wgs84 * (1 - wgs84.e2) + H_wgs84) * sin(B_wgs84)
XYZ_wgs84 = np.array([[X_wgs84], [Y_wgs84], [Z_wgs84]])
r = XYZ_wgs84

# 2. Вычисление топоцентрических прямоугольных мгновенных земных координат по сферическим
delta_hatch = delta
t_hatch = radians(
    degrees(alpha) - S * 15
)

X_hatch_g = rho * cos(delta_hatch) * cos(t_hatch)
Y_hatch_g = rho * cos(delta_hatch) * sin(t_hatch)
Z_hatch_g = rho * sin(delta_hatch)
XYZ_hatch_G = np.array([[X_hatch_g], [Y_hatch_g], [Z_hatch_g]])
r_hatch = XYZ_hatch_G

# Pol(t)
Pol_t = np.array([[1, 0, x_p],
                  [0, 1, y_p * (-1)],
                  [x_p * (-1), y_p, 1]])

# 3. Перевод мгновенных земных топоцентрических координат спутника в средние земные координаты
XYZ_hatch = np.matmul(Pol_t, XYZ_hatch_G)

# 4. Вычисление прямоугольных координат пункта (средних земных геоцентрических) в системе WGS-84
#    через основное уравнение космической геодезии
R_WGS = np.subtract(r, r_hatch)

# 5. Переход из системы эллипсоида ПЗ-90 в систему СК-95
mu = 0  # масштабный коэффициент
fucking = np.array([[mu, w_Z, w_Y * (-1)],
                    [(-1) * w_Z, mu, w_X],
                    [w_Y, w_X * (-1), mu]])

part1 = np.add(XYZ_wgs84, T_XYZ)
part2 = np.matmul(fucking, XYZ_wgs84)

XYZ_sk95 = np.add(part1, part2)
X_sk95 = XYZ_sk95.item(0)
Y_sk95 = XYZ_sk95.item(1)
Z_sk95 = XYZ_sk95.item(2)

# 6. Вычисление геодезических координат B, L, H на эллипсоиде СК-95 по прямоугольным X, Y, Z
L_sk95 = atan(Y_sk95 / X_sk95)
r = sqrt(X_sk95 ** 2 + Y_sk95 ** 2)
# вонючий итеративный процесс ##########################################################################################
epsilon_degrees = 0.1 / 360 / 60 / 60 / 100  # почему
# начальная инициализация
N_sk95 = krasovsky.N(0)
B_sk95 = atan((Z_sk95 + N_sk95 * krasovsky.e2 * sin(0)) / r)
last_val = B_sk95
# цикл
for i in range(10):
    N_sk95 = krasovsky.N(B_sk95)
    B_sk95 = atan((Z_sk95 + N_sk95 * krasovsky.e2 * sin(B_sk95)) / r)
    if abs(B_sk95 - last_val) < epsilon_degrees:
        break
########################################################################################################################
H_sk95 = (Z_sk95 / sin(B_sk95)) - krasovsky.N(B_sk95) * (1 - krasovsky.e2)
BLH_sk95 = np.array([[degrees(B_sk95)], [degrees(L_sk95)], [H_sk95]])

print(rad2dms(B_sk95))
print(rad2dms(L_sk95))
print(round(H_sk95))
